<?xml version="1.0"?>
<net name="DIEN" version="11">
	<layers>
		<layer id="6" name="Inputs/mid_his_batch_ph" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i32" />
			<output>
				<port id="0" precision="I32" names="Inputs/mid_his_batch_ph,Inputs/mid_his_batch_ph:0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Inputs/cat_his_batch_ph" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i32" />
			<output>
				<port id="0" precision="I32" names="Inputs/cat_his_batch_ph,Inputs/cat_his_batch_ph:0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Inputs/uid_batch_ph" type="Parameter" version="opset1">
			<data shape="?" element_type="i32" />
			<output>
				<port id="0" precision="I32" names="Inputs/uid_batch_ph,Inputs/uid_batch_ph:0">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Inputs/mid_batch_ph" type="Parameter" version="opset1">
			<data shape="?" element_type="i32" />
			<output>
				<port id="0" precision="I32" names="Inputs/mid_batch_ph,Inputs/mid_batch_ph:0">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Inputs/cat_batch_ph" type="Parameter" version="opset1">
			<data shape="?" element_type="i32" />
			<output>
				<port id="0" precision="I32" names="Inputs/cat_batch_ph,Inputs/cat_batch_ph:0">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Inputs/mask" type="Parameter" version="opset1">
			<data shape="?,?" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="Inputs/mask,Inputs/mask:0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="Inputs/seq_len_ph" type="Parameter" version="opset1">
			<data shape="?" element_type="i32" />
			<output>
				<port id="0" precision="I32" names="Inputs/seq_len_ph,Inputs/seq_len_ph:0,dien/rnn_1/gru1/CheckSeqLen:0,dien/rnn_1/sequence_length:0,dien/rnn_2/gru2/CheckSeqLen:0,dien/rnn_2/sequence_length:0">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="uid_embedding_var/read" type="Const" version="opset1">
			<data element_type="f32" shape="543060, 18" offset="0" size="39100320" />
			<output>
				<port id="0" precision="FP32" names="uid_embedding_var/read:0">
					<dim>543060</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Embedding_layer/embedding_lookup/axis" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="39100320" size="8" />
			<output>
				<port id="0" precision="I64" names="Embedding_layer/embedding_lookup/axis:0" />
			</output>
		</layer>
		<layer id="9" name="Embedding_layer/embedding_lookup" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>543060</dim>
					<dim>18</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="Embedding_layer/embedding_lookup:0">
					<dim>-1</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="mid_embedding_var/read" type="Const" version="opset1">
			<data element_type="f32" shape="367983, 18" offset="39100328" size="26494776" />
			<output>
				<port id="0" precision="FP32" names="mid_embedding_var/read:0">
					<dim>367983</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Embedding_layer/embedding_lookup_1/axis" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="39100320" size="8" />
			<output>
				<port id="0" precision="I64" names="Embedding_layer/embedding_lookup_1/axis:0" />
			</output>
		</layer>
		<layer id="12" name="Embedding_layer/embedding_lookup_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>367983</dim>
					<dim>18</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="Embedding_layer/embedding_lookup_1:0">
					<dim>-1</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="cat_embedding_var/read11114" type="Const" version="opset1">
			<data element_type="f32" shape="1601, 18" offset="65595104" size="115272" />
			<output>
				<port id="0" precision="FP32" names="cat_embedding_var/read:0">
					<dim>1601</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Embedding_layer/embedding_lookup_4/axis" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="39100320" size="8" />
			<output>
				<port id="0" precision="I64" names="Embedding_layer/embedding_lookup_4/axis:0" />
			</output>
		</layer>
		<layer id="15" name="Embedding_layer/embedding_lookup_4" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1601</dim>
					<dim>18</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="Embedding_layer/embedding_lookup_4:0">
					<dim>-1</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="concat" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>18</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="concat:0">
					<dim>-1</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="mid_embedding_var/read11117" type="Const" version="opset1">
			<data element_type="f32" shape="367983, 18" offset="39100328" size="26494776" />
			<output>
				<port id="0" precision="FP32" names="mid_embedding_var/read:0">
					<dim>367983</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Embedding_layer/embedding_lookup_2/axis" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="39100320" size="8" />
			<output>
				<port id="0" precision="I64" names="Embedding_layer/embedding_lookup_2/axis:0" />
			</output>
		</layer>
		<layer id="19" name="Embedding_layer/embedding_lookup_2" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>367983</dim>
					<dim>18</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="Embedding_layer/embedding_lookup_2:0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="cat_embedding_var/read" type="Const" version="opset1">
			<data element_type="f32" shape="1601, 18" offset="65595104" size="115272" />
			<output>
				<port id="0" precision="FP32" names="cat_embedding_var/read:0">
					<dim>1601</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Embedding_layer/embedding_lookup_5/axis" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="39100320" size="8" />
			<output>
				<port id="0" precision="I64" names="Embedding_layer/embedding_lookup_5/axis:0" />
			</output>
		</layer>
		<layer id="22" name="Embedding_layer/embedding_lookup_5" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1601</dim>
					<dim>18</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="Embedding_layer/embedding_lookup_5:0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="concat_1" type="Concat" version="opset1">
			<data axis="2" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>18</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="concat_1:0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Sum/reduction_indices" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="65710376" size="8" />
			<output>
				<port id="0" precision="I64" names="Sum/reduction_indices:0" />
			</output>
		</layer>
		<layer id="25" name="Sum" type="ReduceSum" version="opset1">
			<data keep_dims="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="Sum:0">
					<dim>-1</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="dien/mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>36</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="dien/mul:0">
					<dim>-1</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="dien/Attention_layer_1/ones_like/Const" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="65710384" size="4" />
			<output>
				<port id="0" precision="FP32" names="dien/Attention_layer_1/ones_like/Const:0" />
			</output>
		</layer>
		<layer id="28" name="dien/Attention_layer_1/ones_like/Shape" type="ShapeOf" version="opset3">
			<data output_type="i32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="dien/Attention_layer_1/ones_like/Broadcast/Cast_1" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="dien/Attention_layer_1/ones_like/Shape:0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="dien/Attention_layer_1/ones_like/Broadcast" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="dien/Attention_layer_1/ones_like:0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="dien/Attention_layer_1/Equal" type="Equal" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="dien/Attention_layer_1/Equal:0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="dien/Attention_layer_1/ExpandDims/dim" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="65710376" size="8" />
			<output>
				<port id="0" precision="I64" names="dien/Attention_layer_1/ExpandDims/dim:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="dien/Attention_layer_1/ExpandDims" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="BOOL">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="dien/Attention_layer_1/ExpandDims:0">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="dien/Attention_layer_1/Cast/x" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1" offset="65710388" size="4" />
			<output>
				<port id="0" precision="FP32" names="dien/Attention_layer_1/Cast/x:0">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="dien/f11_1/kernel/read" type="Const" version="opset1">
			<data element_type="f32" shape="36, 36" offset="65710392" size="5184" />
			<output>
				<port id="0" precision="FP32" names="dien/f11_1/kernel/read:0">
					<dim>36</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="dien/Attention_layer_1/f11_1/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>36</dim>
					<dim>36</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="dien/Attention_layer_1/f11_1/MatMul:0">
					<dim>-1</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="dien/f11_1/bias/read" type="Const" version="opset1">
			<data element_type="f32" shape="1, 36" offset="65715576" size="144" />
			<output>
				<port id="0" precision="FP32" names="dien/f11_1/bias/read:0">
					<dim>1</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="dien/Attention_layer_1/f11_1/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="dien/Attention_layer_1/f11_1/BiasAdd:0">
					<dim>-1</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="dien/Attention_layer_1/Maximum" type="Maximum" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>36</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="dien/Attention_layer_1/Maximum:0">
					<dim>-1</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="dien//prelu_/read" type="Const" version="opset1">
			<data element_type="f32" shape="1, 36" offset="65715720" size="144" />
			<output>
				<port id="0" precision="FP32" names="dien//prelu_/read:0">
					<dim>1</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="dien/Attention_layer_1/Cast_1/x" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1" offset="65710388" size="4" />
			<output>
				<port id="0" precision="FP32" names="dien/Attention_layer_1/Cast_1/x:0">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="dien/Attention_layer_1/Minimum" type="Minimum" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>36</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="dien/Attention_layer_1/Minimum:0">
					<dim>-1</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="dien/Attention_layer_1/mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>36</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="dien/Attention_layer_1/mul:0">
					<dim>-1</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="dien/Attention_layer_1/add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>36</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="dien/Attention_layer_1/add:0">
					<dim>-1</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="dien/Attention_layer_1/Tile/multiples/Unsqueeze" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="65715864" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="dien/rnn_1/concat" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="65715868" size="24" />
			<output>
				<port id="0" precision="I64" names="dien/rnn_1/concat:0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="dien/rnn_1/transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="dien/rnn_1/transpose:0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="dien/rnn_1/gru1/GRUCellZeroState/zeros/Const" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="65710388" size="4" />
			<output>
				<port id="0" precision="FP32" names="dien/rnn_1/gru1/GRUCellZeroState/zeros/Const:0" />
			</output>
		</layer>
		<layer id="49" name="dien/rnn_1/gru1/Shape" type="ShapeOf" version="opset3">
			<data output_type="i32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>36</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32" names="dien/rnn_1/gru1/Shape:0,dien/rnn_1/gru1/Shape_3:0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="dien/rnn_1/gru1/strided_slice/stack" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="65710376" size="8" />
			<output>
				<port id="0" precision="I64" names="dien/rnn_1/gru1/strided_slice/stack:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="dien/rnn_1/gru1/strided_slice/stack_1" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="65715892" size="8" />
			<output>
				<port id="0" precision="I64" names="dien/rnn_1/gru1/strided_slice/stack_1:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="dien/rnn_1/gru1/strided_slice/stack_2" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="65710376" size="8" />
			<output>
				<port id="0" precision="I64" names="dien/rnn_1/gru1/strided_slice/stack_2:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="dien/rnn_1/gru1/strided_slice" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="0" shrink_axis_mask="1" ellipsis_mask="0" />
			<input>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I32" names="dien/rnn_1/gru1/strided_slice:0" />
			</output>
		</layer>
		<layer id="54" name="dien/rnn_1/gru1/GRUCellZeroState/ExpandDims/dim" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="39100320" size="8" />
			<output>
				<port id="0" precision="I64" names="dien/rnn_1/gru1/GRUCellZeroState/ExpandDims/dim:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="dien/rnn_1/gru1/GRUCellZeroState/ExpandDims" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32" names="dien/rnn_1/gru1/GRUCellZeroState/ExpandDims:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="dien/rnn_1/gru1/GRUCellZeroState/Const" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="65715900" size="4" />
			<output>
				<port id="0" precision="I32" names="dien/rnn_1/gru1/GRUCellZeroState/Const:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="dien/rnn_1/gru1/GRUCellZeroState/concat" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="dien/rnn_1/gru1/GRUCellZeroState/zeros/Broadcast/Cast_1" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="dien/rnn_1/gru1/GRUCellZeroState/concat:0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="dien/rnn_1/gru1/GRUCellZeroState/zeros/Broadcast" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="dien/rnn_1/gru1/GRUCellZeroState/zeros:0">
					<dim>-1</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="dien/rnn_1/gru1/zeros/Const" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="65710388" size="4" />
			<output>
				<port id="0" precision="FP32" names="dien/rnn_1/gru1/zeros/Const:0" />
			</output>
		</layer>
		<layer id="61" name="dien/rnn_1/gru1/strided_slice_2/stack" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="65710376" size="8" />
			<output>
				<port id="0" precision="I64" names="dien/rnn_1/gru1/strided_slice_2/stack:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="dien/rnn_1/gru1/strided_slice_2/stack_1" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="65715892" size="8" />
			<output>
				<port id="0" precision="I64" names="dien/rnn_1/gru1/strided_slice_2/stack_1:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="dien/rnn_1/gru1/strided_slice_2/stack_2" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="65710376" size="8" />
			<output>
				<port id="0" precision="I64" names="dien/rnn_1/gru1/strided_slice_2/stack_2:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="dien/rnn_1/gru1/strided_slice_2" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="0" shrink_axis_mask="1" ellipsis_mask="0" />
			<input>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I32" names="dien/rnn_1/gru1/strided_slice_2:0" />
			</output>
		</layer>
		<layer id="65" name="dien/rnn_1/gru1/ExpandDims/dim" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="39100320" size="8" />
			<output>
				<port id="0" precision="I64" names="dien/rnn_1/gru1/ExpandDims/dim:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="dien/rnn_1/gru1/ExpandDims" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32" names="dien/rnn_1/gru1/ExpandDims:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="dien/rnn_1/gru1/Const_1" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="65715900" size="4" />
			<output>
				<port id="0" precision="I32" names="dien/rnn_1/gru1/Const_1:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="dien/rnn_1/gru1/concat" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="dien/rnn_1/gru1/zeros/Broadcast/Cast_1" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="dien/rnn_1/gru1/concat:0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="dien/rnn_1/gru1/zeros/Broadcast" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="dien/rnn_1/gru1/zeros:0">
					<dim>-1</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="dien/rnn_1/gru1/while/Enter" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="65710388" size="4" />
			<output>
				<port id="0" precision="I32" names="dien/rnn_1/gru1/while/Enter:0" />
			</output>
		</layer>
		<layer id="72" name="dien/rnn_1/gru1/while/LoopCond/TensorIteratorCondition_/TensorIterator" type="TensorIterator" version="opset1">
			<port_map>
				<input axis="0" external_port_id="0" internal_layer_id="4" start="0" end="-1" stride="1" part_size="1" />
				<input external_port_id="1" internal_layer_id="3" />
				<input external_port_id="2" internal_layer_id="2" />
				<input external_port_id="3" internal_layer_id="1" />
				<input external_port_id="4" internal_layer_id="0" />
				<output axis="0" external_port_id="5" internal_layer_id="22" start="0" end="-1" stride="1" part_size="1" />
			</port_map>
			<back_edges>
				<edge from-layer="29" to-layer="3" />
				<edge from-layer="7" to-layer="0" />
			</back_edges>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>36</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>36</dim>
				</port>
				<port id="3" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="4" precision="I32" />
			</input>
			<output>
				<port id="5" precision="FP32" names="dien/rnn_1/gru1/TensorArrayStack/TensorArrayGatherV3:0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>36</dim>
				</port>
			</output>
			<body>
				<layers>
					<layer id="4" name="74" type="Parameter" version="opset1">
						<data shape="1,?,36" element_type="f32" />
						<rt_info>
							<attribute name="fused_names" version="0" value="74" />
						</rt_info>
						<output>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>-1</dim>
								<dim>36</dim>
							</port>
						</output>
					</layer>
					<layer id="3" name="82" type="Parameter" version="opset1">
						<data shape="?,36" element_type="f32" />
						<rt_info>
							<attribute name="fused_names" version="0" value="82" />
						</rt_info>
						<output>
							<port id="0" precision="FP32">
								<dim>-1</dim>
								<dim>36</dim>
							</port>
						</output>
					</layer>
					<layer id="2" name="84" type="Parameter" version="opset1">
						<data shape="?,36" element_type="f32" />
						<rt_info>
							<attribute name="fused_names" version="0" value="84" />
						</rt_info>
						<output>
							<port id="0" precision="FP32">
								<dim>-1</dim>
								<dim>36</dim>
							</port>
						</output>
					</layer>
					<layer id="1" name="86" type="Parameter" version="opset1">
						<data shape="?" element_type="i32" />
						<rt_info>
							<attribute name="fused_names" version="0" value="86" />
						</rt_info>
						<output>
							<port id="0" precision="I32">
								<dim>-1</dim>
							</port>
						</output>
					</layer>
					<layer id="0" name="92" type="Parameter" version="opset1">
						<data shape="" element_type="i32" />
						<rt_info>
							<attribute name="fused_names" version="0" value="92" />
						</rt_info>
						<output>
							<port id="0" precision="I32" />
						</output>
					</layer>
					<layer id="5" name="dien/rnn_1/gru1/while/add/y" type="Const" version="opset1">
						<data element_type="i32" shape="" offset="65715864" size="4" />
						<rt_info>
							<attribute name="fused_names" version="0" value="dien/rnn_1/gru1/while/add/y" />
						</rt_info>
						<output>
							<port id="0" precision="I32" names="dien/rnn_1/gru1/while/add/y:0" />
						</output>
					</layer>
					<layer id="6" name="dien/rnn_1/gru1/while/add" type="Add" version="opset1">
						<data auto_broadcast="numpy" />
						<rt_info>
							<attribute name="fused_names" version="0" value="dien/rnn_1/gru1/while/add" />
						</rt_info>
						<input>
							<port id="0" precision="I32" />
							<port id="1" precision="I32" />
						</input>
						<output>
							<port id="2" precision="I32" names="dien/rnn_1/gru1/while/add:0" />
						</output>
					</layer>
					<layer id="8" name="90/EltwiseUnsqueeze_input_port_1/value408885" type="Const" version="opset1">
						<data element_type="i64" shape="1" offset="39100320" size="8" />
						<rt_info>
							<attribute name="fused_names" version="0" value="90/EltwiseUnsqueeze_input_port_1/value408885" />
						</rt_info>
						<output>
							<port id="0" precision="I64">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="9" name="90/EltwiseUnsqueeze" type="Unsqueeze" version="opset1">
						<rt_info>
							<attribute name="fused_names" version="0" value="90/EltwiseUnsqueeze" />
						</rt_info>
						<input>
							<port id="0" precision="I32" />
							<port id="1" precision="I64">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="I32">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="10" name="dien/rnn_1/gru1/while/GreaterEqual" type="GreaterEqual" version="opset1">
						<data auto_broadcast="numpy" />
						<rt_info>
							<attribute name="fused_names" version="0" value="dien/rnn_1/gru1/while/GreaterEqual" />
						</rt_info>
						<input>
							<port id="0" precision="I32">
								<dim>1</dim>
							</port>
							<port id="1" precision="I32">
								<dim>-1</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="BOOL" names="dien/rnn_1/gru1/while/GreaterEqual:0">
								<dim>-1</dim>
							</port>
						</output>
					</layer>
					<layer id="11" name="dien/rnn_1/gru1/while/Select/Broadcast//value512876" type="Const" version="opset1">
						<data element_type="i64" shape="1" offset="65710376" size="8" />
						<rt_info>
							<attribute name="fused_names" version="0" value="dien/rnn_1/gru1/while/Select/Broadcast//value512876" />
						</rt_info>
						<output>
							<port id="0" precision="I64">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="12" name="dien/rnn_1/gru1/while/Select/Broadcast/" type="Unsqueeze" version="opset1">
						<rt_info>
							<attribute name="fused_names" version="0" value="dien/rnn_1/gru1/while/Select/Broadcast/" />
						</rt_info>
						<input>
							<port id="0" precision="BOOL">
								<dim>-1</dim>
							</port>
							<port id="1" precision="I64">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="BOOL">
								<dim>-1</dim>
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="13" name="67900" type="Const" version="opset1">
						<data element_type="i64" shape="1" offset="39100320" size="8" />
						<rt_info>
							<attribute name="fused_names" version="0" value="67900" />
						</rt_info>
						<output>
							<port id="0" precision="I64">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="14" name="dien/rnn_1/gru1/while/TensorArrayReadV3/Output_0/Data_/InputSqueeze" type="Squeeze" version="opset1">
						<rt_info>
							<attribute name="fused_names" version="0" value="dien/rnn_1/gru1/while/TensorArrayReadV3/Output_0/Data_/InputSqueeze" />
						</rt_info>
						<input>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>-1</dim>
								<dim>36</dim>
							</port>
							<port id="1" precision="I64">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32" names="dien/rnn_1/gru1/while/TensorArrayReadV3:0">
								<dim>-1</dim>
								<dim>36</dim>
							</port>
						</output>
					</layer>
					<layer id="15" name="Concat_3893" type="Const" version="opset1">
						<data element_type="f32" shape="108, 36" offset="65715904" size="15552" />
						<rt_info>
							<attribute name="fused_names" version="0" value="82, dien/rnn_1/gru1/while/TensorArrayReadV3/Output_0/Data_/InputSqueeze, dien/rnn_1/gru1/while/gru_cell/BiasAdd/Add, dien/rnn_1/gru1/while/gru_cell/BiasAdd/Enter, dien/rnn_1/gru1/while/gru_cell/BiasAdd_1/Add, dien/rnn_1/gru1/while/gru_cell/BiasAdd_1/Enter, dien/rnn_1/gru1/while/gru_cell/MatMul, dien/rnn_1/gru1/while/gru_cell/MatMul/Enter, dien/rnn_1/gru1/while/gru_cell/MatMul_1, dien/rnn_1/gru1/while/gru_cell/MatMul_1/Enter, dien/rnn_1/gru1/while/gru_cell/Sigmoid, dien/rnn_1/gru1/while/gru_cell/Tanh, dien/rnn_1/gru1/while/gru_cell/add, dien/rnn_1/gru1/while/gru_cell/concat, dien/rnn_1/gru1/while/gru_cell/concat_1, dien/rnn_1/gru1/while/gru_cell/mul, dien/rnn_1/gru1/while/gru_cell/mul_1, dien/rnn_1/gru1/while/gru_cell/mul_2, dien/rnn_1/gru1/while/gru_cell/split, dien/rnn_1/gru1/while/gru_cell/split/split_dim, dien/rnn_1/gru1/while/gru_cell/sub, dien/rnn_1/gru1/while/gru_cell/sub/neg_, dien/rnn_1/gru1/while/gru_cell/sub/x" />
						</rt_info>
						<output>
							<port id="0" precision="FP32">
								<dim>108</dim>
								<dim>36</dim>
							</port>
						</output>
					</layer>
					<layer id="16" name="Concat_3894" type="Const" version="opset1">
						<data element_type="f32" shape="108, 36" offset="65731456" size="15552" />
						<rt_info>
							<attribute name="fused_names" version="0" value="82, dien/rnn_1/gru1/while/TensorArrayReadV3/Output_0/Data_/InputSqueeze, dien/rnn_1/gru1/while/gru_cell/BiasAdd/Add, dien/rnn_1/gru1/while/gru_cell/BiasAdd/Enter, dien/rnn_1/gru1/while/gru_cell/BiasAdd_1/Add, dien/rnn_1/gru1/while/gru_cell/BiasAdd_1/Enter, dien/rnn_1/gru1/while/gru_cell/MatMul, dien/rnn_1/gru1/while/gru_cell/MatMul/Enter, dien/rnn_1/gru1/while/gru_cell/MatMul_1, dien/rnn_1/gru1/while/gru_cell/MatMul_1/Enter, dien/rnn_1/gru1/while/gru_cell/Sigmoid, dien/rnn_1/gru1/while/gru_cell/Tanh, dien/rnn_1/gru1/while/gru_cell/add, dien/rnn_1/gru1/while/gru_cell/concat, dien/rnn_1/gru1/while/gru_cell/concat_1, dien/rnn_1/gru1/while/gru_cell/mul, dien/rnn_1/gru1/while/gru_cell/mul_1, dien/rnn_1/gru1/while/gru_cell/mul_2, dien/rnn_1/gru1/while/gru_cell/split, dien/rnn_1/gru1/while/gru_cell/split/split_dim, dien/rnn_1/gru1/while/gru_cell/sub, dien/rnn_1/gru1/while/gru_cell/sub/neg_, dien/rnn_1/gru1/while/gru_cell/sub/x" />
						</rt_info>
						<output>
							<port id="0" precision="FP32">
								<dim>108</dim>
								<dim>36</dim>
							</port>
						</output>
					</layer>
					<layer id="17" name="Squeeze_3897" type="Const" version="opset1">
						<data element_type="f32" shape="108" offset="65747008" size="432" />
						<rt_info>
							<attribute name="fused_names" version="0" value="82, dien/rnn_1/gru1/while/TensorArrayReadV3/Output_0/Data_/InputSqueeze, dien/rnn_1/gru1/while/gru_cell/BiasAdd/Add, dien/rnn_1/gru1/while/gru_cell/BiasAdd/Enter, dien/rnn_1/gru1/while/gru_cell/BiasAdd_1/Add, dien/rnn_1/gru1/while/gru_cell/BiasAdd_1/Enter, dien/rnn_1/gru1/while/gru_cell/MatMul, dien/rnn_1/gru1/while/gru_cell/MatMul/Enter, dien/rnn_1/gru1/while/gru_cell/MatMul_1, dien/rnn_1/gru1/while/gru_cell/MatMul_1/Enter, dien/rnn_1/gru1/while/gru_cell/Sigmoid, dien/rnn_1/gru1/while/gru_cell/Tanh, dien/rnn_1/gru1/while/gru_cell/add, dien/rnn_1/gru1/while/gru_cell/concat, dien/rnn_1/gru1/while/gru_cell/concat_1, dien/rnn_1/gru1/while/gru_cell/mul, dien/rnn_1/gru1/while/gru_cell/mul_1, dien/rnn_1/gru1/while/gru_cell/mul_2, dien/rnn_1/gru1/while/gru_cell/split, dien/rnn_1/gru1/while/gru_cell/split/split_dim, dien/rnn_1/gru1/while/gru_cell/sub, dien/rnn_1/gru1/while/gru_cell/sub/neg_, dien/rnn_1/gru1/while/gru_cell/sub/x" />
						</rt_info>
						<output>
							<port id="0" precision="FP32">
								<dim>108</dim>
							</port>
						</output>
					</layer>
					<layer id="18" name="dien/rnn_1/gru1/while/gru_cell/add" type="GRUCell" version="opset3">
						<data linear_before_reset="false" hidden_size="36" activations="sigmoid, tanh" activations_alpha="" activations_beta="" clip="0" />
						<rt_info>
							<attribute name="fused_names" version="0" value="82, dien/rnn_1/gru1/while/TensorArrayReadV3/Output_0/Data_/InputSqueeze, dien/rnn_1/gru1/while/gru_cell/BiasAdd/Add, dien/rnn_1/gru1/while/gru_cell/BiasAdd/Enter, dien/rnn_1/gru1/while/gru_cell/BiasAdd_1/Add, dien/rnn_1/gru1/while/gru_cell/BiasAdd_1/Enter, dien/rnn_1/gru1/while/gru_cell/MatMul, dien/rnn_1/gru1/while/gru_cell/MatMul/Enter, dien/rnn_1/gru1/while/gru_cell/MatMul_1, dien/rnn_1/gru1/while/gru_cell/MatMul_1/Enter, dien/rnn_1/gru1/while/gru_cell/Sigmoid, dien/rnn_1/gru1/while/gru_cell/Tanh, dien/rnn_1/gru1/while/gru_cell/add, dien/rnn_1/gru1/while/gru_cell/concat, dien/rnn_1/gru1/while/gru_cell/concat_1, dien/rnn_1/gru1/while/gru_cell/mul, dien/rnn_1/gru1/while/gru_cell/mul_1, dien/rnn_1/gru1/while/gru_cell/mul_2, dien/rnn_1/gru1/while/gru_cell/split, dien/rnn_1/gru1/while/gru_cell/split/split_dim, dien/rnn_1/gru1/while/gru_cell/sub, dien/rnn_1/gru1/while/gru_cell/sub/neg_, dien/rnn_1/gru1/while/gru_cell/sub/x" />
						</rt_info>
						<input>
							<port id="0" precision="FP32">
								<dim>-1</dim>
								<dim>36</dim>
							</port>
							<port id="1" precision="FP32">
								<dim>-1</dim>
								<dim>36</dim>
							</port>
							<port id="2" precision="FP32">
								<dim>108</dim>
								<dim>36</dim>
							</port>
							<port id="3" precision="FP32">
								<dim>108</dim>
								<dim>36</dim>
							</port>
							<port id="4" precision="FP32">
								<dim>108</dim>
							</port>
						</input>
						<output>
							<port id="5" precision="FP32" names="dien/rnn_1/gru1/while/gru_cell/add:0">
								<dim>-1</dim>
								<dim>36</dim>
							</port>
						</output>
					</layer>
					<layer id="19" name="dien/rnn_1/gru1/while/Select" type="Select" version="opset1">
						<data auto_broadcast="numpy" />
						<rt_info>
							<attribute name="fused_names" version="0" value="dien/rnn_1/gru1/while/Select" />
						</rt_info>
						<input>
							<port id="0" precision="BOOL">
								<dim>-1</dim>
								<dim>1</dim>
							</port>
							<port id="1" precision="FP32">
								<dim>-1</dim>
								<dim>36</dim>
							</port>
							<port id="2" precision="FP32">
								<dim>-1</dim>
								<dim>36</dim>
							</port>
						</input>
						<output>
							<port id="3" precision="FP32" names="dien/rnn_1/gru1/while/Select:0">
								<dim>-1</dim>
								<dim>36</dim>
							</port>
						</output>
					</layer>
					<layer id="20" name="70879" type="Const" version="opset1">
						<data element_type="i64" shape="1" offset="39100320" size="8" />
						<rt_info>
							<attribute name="fused_names" version="0" value="70879" />
						</rt_info>
						<output>
							<port id="0" precision="I64">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="21" name="dien/rnn_1/gru1/while/Select/Output_0/Data_/OutputUnsqueeze" type="Unsqueeze" version="opset1">
						<rt_info>
							<attribute name="fused_names" version="0" value="dien/rnn_1/gru1/while/Select/Output_0/Data_/OutputUnsqueeze" />
						</rt_info>
						<input>
							<port id="0" precision="FP32">
								<dim>-1</dim>
								<dim>36</dim>
							</port>
							<port id="1" precision="I64">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>1</dim>
								<dim>-1</dim>
								<dim>36</dim>
							</port>
						</output>
					</layer>
					<layer id="23" name="92/EltwiseUnsqueeze_input_port_1/value404903" type="Const" version="opset1">
						<data element_type="i64" shape="1" offset="39100320" size="8" />
						<rt_info>
							<attribute name="fused_names" version="0" value="92/EltwiseUnsqueeze_input_port_1/value404903" />
						</rt_info>
						<output>
							<port id="0" precision="I64">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="24" name="92/EltwiseUnsqueeze" type="Unsqueeze" version="opset1">
						<rt_info>
							<attribute name="fused_names" version="0" value="92/EltwiseUnsqueeze" />
						</rt_info>
						<input>
							<port id="0" precision="I32" />
							<port id="1" precision="I64">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="I32">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="25" name="dien/rnn_1/gru1/while/GreaterEqual_1" type="GreaterEqual" version="opset1">
						<data auto_broadcast="numpy" />
						<rt_info>
							<attribute name="fused_names" version="0" value="dien/rnn_1/gru1/while/GreaterEqual_1" />
						</rt_info>
						<input>
							<port id="0" precision="I32">
								<dim>1</dim>
							</port>
							<port id="1" precision="I32">
								<dim>-1</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="BOOL" names="dien/rnn_1/gru1/while/GreaterEqual_1:0">
								<dim>-1</dim>
							</port>
						</output>
					</layer>
					<layer id="26" name="dien/rnn_1/gru1/while/Select_1/Broadcast//value516909" type="Const" version="opset1">
						<data element_type="i64" shape="1" offset="65710376" size="8" />
						<rt_info>
							<attribute name="fused_names" version="0" value="dien/rnn_1/gru1/while/Select_1/Broadcast//value516909" />
						</rt_info>
						<output>
							<port id="0" precision="I64">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="27" name="dien/rnn_1/gru1/while/Select_1/Broadcast/" type="Unsqueeze" version="opset1">
						<rt_info>
							<attribute name="fused_names" version="0" value="dien/rnn_1/gru1/while/Select_1/Broadcast/" />
						</rt_info>
						<input>
							<port id="0" precision="BOOL">
								<dim>-1</dim>
							</port>
							<port id="1" precision="I64">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="BOOL">
								<dim>-1</dim>
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="28" name="dien/rnn_1/gru1/while/Select_1" type="Select" version="opset1">
						<data auto_broadcast="numpy" />
						<rt_info>
							<attribute name="fused_names" version="0" value="dien/rnn_1/gru1/while/Select_1" />
						</rt_info>
						<input>
							<port id="0" precision="BOOL">
								<dim>-1</dim>
								<dim>1</dim>
							</port>
							<port id="1" precision="FP32">
								<dim>-1</dim>
								<dim>36</dim>
							</port>
							<port id="2" precision="FP32">
								<dim>-1</dim>
								<dim>36</dim>
							</port>
						</input>
						<output>
							<port id="3" precision="FP32" names="dien/rnn_1/gru1/while/Select_1:0">
								<dim>-1</dim>
								<dim>36</dim>
							</port>
						</output>
					</layer>
					<layer id="29" name="dien/rnn_1/gru1/while/Select_1/Output_0/Data_/sink_port_0" type="Result" version="opset1">
						<rt_info>
							<attribute name="fused_names" version="0" value="dien/rnn_1/gru1/while/Select_1/Output_0/Data_/sink_port_0" />
						</rt_info>
						<input>
							<port id="0" precision="FP32">
								<dim>-1</dim>
								<dim>36</dim>
							</port>
						</input>
					</layer>
					<layer id="22" name="72/sink_port_0" type="Result" version="opset1">
						<rt_info>
							<attribute name="fused_names" version="0" value="72/sink_port_0" />
						</rt_info>
						<input>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>-1</dim>
								<dim>36</dim>
							</port>
						</input>
					</layer>
					<layer id="7" name="dien/rnn_1/gru1/while/add/Output_0/Data_/sink_port_0" type="Result" version="opset1">
						<rt_info>
							<attribute name="fused_names" version="0" value="dien/rnn_1/gru1/while/add/Output_0/Data_/sink_port_0" />
						</rt_info>
						<input>
							<port id="0" precision="I32" />
						</input>
					</layer>
				</layers>
				<edges>
					<edge from-layer="0" from-port="0" to-layer="9" to-port="0" />
					<edge from-layer="0" from-port="0" to-layer="24" to-port="0" />
					<edge from-layer="0" from-port="0" to-layer="6" to-port="0" />
					<edge from-layer="1" from-port="0" to-layer="10" to-port="1" />
					<edge from-layer="1" from-port="0" to-layer="25" to-port="1" />
					<edge from-layer="2" from-port="0" to-layer="19" to-port="1" />
					<edge from-layer="3" from-port="0" to-layer="28" to-port="1" />
					<edge from-layer="3" from-port="0" to-layer="18" to-port="1" />
					<edge from-layer="4" from-port="0" to-layer="14" to-port="0" />
					<edge from-layer="5" from-port="0" to-layer="6" to-port="1" />
					<edge from-layer="6" from-port="2" to-layer="7" to-port="0" />
					<edge from-layer="8" from-port="0" to-layer="9" to-port="1" />
					<edge from-layer="9" from-port="2" to-layer="10" to-port="0" />
					<edge from-layer="10" from-port="2" to-layer="12" to-port="0" />
					<edge from-layer="11" from-port="0" to-layer="12" to-port="1" />
					<edge from-layer="12" from-port="2" to-layer="19" to-port="0" />
					<edge from-layer="13" from-port="0" to-layer="14" to-port="1" />
					<edge from-layer="14" from-port="2" to-layer="18" to-port="0" />
					<edge from-layer="15" from-port="0" to-layer="18" to-port="2" />
					<edge from-layer="16" from-port="0" to-layer="18" to-port="3" />
					<edge from-layer="17" from-port="0" to-layer="18" to-port="4" />
					<edge from-layer="18" from-port="5" to-layer="19" to-port="2" />
					<edge from-layer="18" from-port="5" to-layer="28" to-port="2" />
					<edge from-layer="19" from-port="3" to-layer="21" to-port="0" />
					<edge from-layer="20" from-port="0" to-layer="21" to-port="1" />
					<edge from-layer="21" from-port="2" to-layer="22" to-port="0" />
					<edge from-layer="23" from-port="0" to-layer="24" to-port="1" />
					<edge from-layer="24" from-port="2" to-layer="25" to-port="0" />
					<edge from-layer="25" from-port="2" to-layer="27" to-port="0" />
					<edge from-layer="26" from-port="0" to-layer="27" to-port="1" />
					<edge from-layer="27" from-port="2" to-layer="28" to-port="0" />
					<edge from-layer="28" from-port="3" to-layer="29" to-port="0" />
				</edges>
				<rt_info />
			</body>
		</layer>
		<layer id="73" name="dien/rnn_1/gru1/concat_1" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="65715868" size="24" />
			<output>
				<port id="0" precision="I64" names="dien/rnn_1/gru1/concat_1:0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="dien/rnn_1/gru1/transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="dien/Attention_layer_1/Shape" type="ShapeOf" version="opset3">
			<data output_type="i32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>36</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32" names="dien/Attention_layer_1/Shape:0,dien/Attention_layer_1/Shape_2:0,dien/Attention_layer_1/Shape_5:0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="dien/Attention_layer_1/strided_slice/stack" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="65710376" size="8" />
			<output>
				<port id="0" precision="I64" names="dien/Attention_layer_1/strided_slice/stack:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="dien/Attention_layer_1/strided_slice/stack_1" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="65715892" size="8" />
			<output>
				<port id="0" precision="I64" names="dien/Attention_layer_1/strided_slice/stack_1:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="dien/Attention_layer_1/strided_slice/stack_2" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="65710376" size="8" />
			<output>
				<port id="0" precision="I64" names="dien/Attention_layer_1/strided_slice/stack_2:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
